package basicdata

import "fmt"

/*
2. 数值类型（Numeric Types）
(1) 整数类型（Integer）

	有符号整数（可表示正负）：
	int8 （8位，范围：-128 到 127）
	int16 （16位，范围：-32768 到 32767）
	int32 （32位，范围：-2^31 到 2^31-1）
	int64 （64位，范围：-2^63 到 2^63-1）
	int （平台相关，32位或64位）

	无符号整数（仅表示非负数）：
	uint8 （8位，范围：0 到 255）
	uint16 （16位，范围：0 到 65535）
	uint32 （32位，范围：0 到 2^32-1）
	uint64 （64位，范围：0 到 2^64-1）
	uint （平台相关，32位或64位）

	特殊整数类型：
	byte （ uint8 的别名，用于表示字节）
	rune （ int32 的别名，用于表示 Unicode 码点）

(2) 浮点数类型（Floating-Point）

	float32 （32位，单精度浮点数）
	float64 （64位，双精度浮点数，默认）

(3) 复数类型（Complex）

	complex64 （实部和虚部均为 float32 ）
	complex128 （实部和虚部均为 float64 ）
*/
func NumerTutorial() {

	// int类型，具体是int32还是int64，取决于操作系统
	var a int = 10

	var b float32 = 12.3
	var c float64 = 12.6

	// type byte = uint8
	var d byte = 255
	var e byte = 'a'
	// type rune = int32
	var f rune = '中'
	var g rune = '😄'
	// 打印的是 ASICI 码对于的值
	var h int = 'a'
	fmt.Println(a, b, c, d, e, f, g, h)

	var c1 complex64 = complex(3, 4)
	fmt.Println("c1:", c1)

	var c2 complex64 = 1 + 2i
	fmt.Println("c2:", c2)

	c3 := real(c2) // 1
	c4 := imag(c2) // 2
	fmt.Println("c3:", c3, "c4:", c4)
	println("c3:", c3, "c4:", c4)
}